#оси 
## Условия
Написать программу определения типа файла, указанного при запросе. Предусмотреть обработку сигнала прерывания от клавиатуры. При поступлении 3 сигналов прерывания вывести все файлы текущего каталога, написанные на Си.

- `ls -la`  - вывести все файлы (даже те, имена которых начинаются с точки)
- `ls -la -d <имя_файла>`  - вывести информацию о файле в таком формате:
	- `xrw-r--r-- uid размер имя_файла`, где x - формат файла (d, p, b, c, l, s)
	- `-d` - не позволяем залезать внутрь директории, если нам её передали

## Алгоритм решения задачи
### Программа-процесс
- Указание метода обработки сигнала ([[sigaction]])
- Запрос на имя файла
- Проверка введённых данных
- Создание межроцессного канала ([[pipe]])
- Создание процесса-сына([[fork]])
- Ожидание завершения процесса сына
- Считывание результатов сына
- Обрезка результата сына и вывод
- Конец

### Программа-обработчик
```
#include <stdio.h>
#include <unistd.h>
#include <stdlib.h>
#include <string.h>
#include <signal.h>
#include <sys/wait.h>

int count = 0; // счётчик прерываний
void func() {
}

void main() {
	int fd, p[2];
	char name[256], buf[80];
	memset(name, 0, 256);
	memset(buf, 0, 80);
	struct sigaction arg;
	arg.sa_handler = func;
	sigprocmask(0, 0, &arg.sa_mask);
	arg.sa_flags = 0;
	sigaction = (SIGINT, &arg, 0);
	while(1) {
		printf("Введите имя файла:");
		scanf("%s", name); // read(0, name, 256);
		if (!access(name, F_OK)) {
		break;
		}
		pipe(p); // добавили пайп на чтение в ячейку 3 и пайп на запись в ячейку 4
		if (fork() == 0) {
			close(p[0]);
			close(1);
			dup(p[1]);
			execl("/bin/ls", "ls", "-la", "-d", name, NULL);
		} else {
			wait(0);
			close(p[1]);
			while(1) {
				if (read(p[0], buf, 80) != 0) {
					if (buf[0] == '-') {printf("Файл %s обычный");}
					if (buf[0] == 'd') {printf("фАЙЛ %S - директория");}
					...
				}
			}
		}
	}
}
```